; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star4)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star3)
	(supports instrument9 spectrograph0)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon13)
	(supports instrument11 thermograph1)
	(supports instrument11 thermograph2)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 spectrograph0)
	(supports instrument12 thermograph2)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
	(supports instrument13 spectrograph0)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star4)
	(calibration_target instrument13 GroundStation2)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
)
(:goal (and
	(pointing satellite3 Phenomenon13)
	(have_image Planet7 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Star9 thermograph2)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
))

)

; plan
1. (turn_to satellite3 phenomenon13 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon13)
   goals met: 1 of 8
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
3. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 1 of 8
4. (turn_to satellite2 planet7 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet7)
   goals met: 1 of 8
5. (take_image satellite2 planet7 instrument4 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 8
6. (turn_to satellite2 planet12 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet12)
   goals met: 2 of 8
7. (take_image satellite2 planet12 instrument4 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 3 of 8
8. (turn_to satellite2 phenomenon13 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon13 instrument4 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 4 of 8
10. (turn_to satellite2 phenomenon11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 8
11. (take_image satellite2 phenomenon11 instrument4 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 5 of 8
12. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 5 of 8
13. (take_image satellite2 star10 instrument4 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 6 of 8
14. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   goals met: 6 of 8
15. (take_image satellite2 star8 instrument4 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 7 of 8
16. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 7 of 8
17. (take_image satellite2 star9 instrument4 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 8 of 8
